{
	"@metadata": {
		"authors": [
			"The Wikidata Team"
		]
	},
	"wikibaseschema-desc": "{{desc|name=WikibaseSchema|url=https://www.mediawiki.org/wiki/Extension:WikibaseSchema}}",
	"special-newschema": "Title for the new Schema Special Page",
	"wikibaseschema-newschema-label": "Input label for the label field on Special:NewSchema",
	"wikibaseschema-newschema-description": "Input label for the description field on Special:NewSchema",
	"wikibaseschema-newschema-aliases": "Input label for the aliases field on Special:NewSchema",
	"wikibaseschema-newschema-schema-shexc": "Input label for the schema field (using Shape Expressions compact syntax) on Special:NewSchema",
	"wikibaseschema-newschema-submit": "Label on the submit button on the NewSchema special page",
	"wikibaseschema-newschema-copyright": "A short copyright warning displayed on the NewSchema special page.\n\nParameters:\n* $1 - the name of the button the message is referring to, set in the {{msg-mw|wikibaseschema-newschema-submit}} message\n* $2 - the name of the wiki's page describing the terms of use\n* $3 - an external link to the license with the license's name as link text",
	"wikibaseschema-anonymouseditwarning": "Warning message that is displayed using the MediaWiki notification system each time an anonymous user starts to edit something on a Schema page (e.g. by clicking an edit button).\n\nBasically, the message shall make the user aware that their IP will be recorded when saving as long as they are not logged in.",
	"wikibaseschema-label-edit-placeholder": "Placeholder to add the label in English",
	"wikibaseschema-description-edit-placeholder": "Placeholder to add the description in English",
	"wikibaseschema-aliases-edit-placeholder": "Placeholder to add aliases for the Schema in English",
	"wikibaseschema-editpage-label-inputlabel": "Input label for the label field on the edit page",
	"wikibaseschema-editpage-description-inputlabel": "Input label for the description field on the edit page",
	"wikibaseschema-editpage-aliases-inputlabel": "Input label for the aliases field on the edit page",
	"wikibaseschema-editpage-schema-inputlabel": "Input label for the Schema field on the edit page",
	"wikibaseschema-error-schemadeleted": "Error message when trying to edit a schema that doesn't exist.",
	"wikibaseschema-error-schemaupdate-failed": "Error message when saving the Schema after edit wasn't successful",
	"wikibaseschema-error-saving-failed": "Error message when saving a schema has failed.\n\nParameters:\n* $1 - the message of the exception",
	"wikibaseschema-error-not-post": "Error message when a HTTP POST request is expected but something else was received.",
	"wikibaseschema-noschema": "Text that is shown on a non-existant page in the Schema namespace",
	"wikibaseschema-summary-generated": "The label above the summary input, stating that will be appended to a generated summary. ",
	"wikibaseschema-diff-label": "Label designating the change in the Labels when viewing a diff of two Schemas",
	"wikibaseschema-diff-description": "Label designating the change in the Description when viewing a diff of two Schemas",
	"wikibaseschema-diff-aliases": "Label designating the change in the Aliases when viewing a diff of two Schemas",
	"wikibaseschema-diff-schema": "Label designating the change in the Schema code when viewing a diff of two Schemas",
	"wikibaseschema-summary-newschema": "A generic message for the recent changes or page history, stating that the Schema was created. \n\nParameters:\n* $1 - the label of the Schema",
	"wikibaseschema-summary-update": "A generic message used when different parts of a Schema may have been updated.",
	"wikibaseschema-undo-heading": "Heading for the undo view.\n\nParameters:\n* $1 - The ID of the Schema",
	"wikibaseschema-undo-heading-failed": "Heading if the change cannot be undone for some reason",
	"wikibaseschema-undo-bad-revisions": "Error message saying that the given revision versions don't work out.",
	"wikibaseschema-undo-cannot-apply-patch": "Error message saying that the change cannot be undone because it was further changed later.",
	"wikibaseschema-undo-old-revision": "short message for the undo view designating the left side as the revision that the user tries to undo"
}
