{
	"@metadata": {
		"authors": [
			"The Wikidata Team"
		]
	},
	"special-newschema": "Title for the new Schema Special Page",
	"wikibaseschema-newschema-label": "Input label for the label field on Special:NewSchema",
	"wikibaseschema-newschema-description": "Input label for the description field on Special:NewSchema",
	"wikibaseschema-newschema-aliases": "Input label for the aliases field on Special:NewSchema",
	"wikibaseschema-newschema-schema-shexc": "Input label for the schema field (using Shape Expressions compact syntax) on Special:NewSchema",
	"wikibaseschema-newschema-submit": "Label on the submit button on the NewSchema special page",
	"wikibaseschema-newschema-copyright": "A short copyright warning displayed on the NewSchema special page.\n\nParameters:\n* $1 - the name of the button the message is referring to, set in the {{msg-mw|wikibaseschema-newschema-submit}} message\n* $2 - the name of the wiki's page describing the terms of use\n* $3 - an external link to the license with the license's name as link text",
	"wikibaseschema-anonymouseditwarning": "Warning message that is displayed using the MediaWiki notification system each time an anonymous user starts to edit something on a Schema page (e.g. by clicking an edit button).\n\nBasically, the message shall make the user aware that their IP will be recorded when saving as long as they are not logged in.",
	"wikibaseschema-desc": "{{desc|name=WikibaseSchema|url=https://www.mediawiki.org/wiki/Extension:WikibaseSchema}}",
	"wikibaseschema-label-edit-placeholder": "Placeholder to add the label in English",
	"wikibaseschema-description-edit-placeholder": "Placeholder to add the description in English",
	"wikibaseschema-aliases-edit-placeholder": "Placeholder to add aliases for the Schema in English",
	"wikibaseschema-editpage-label-inputlabel": "Input label for the label field on the edit page",
	"wikibaseschema-editpage-description-inputlabel": "Input label for the description field on the edit page",
	"wikibaseschema-editpage-aliases-inputlabel": "Input label for the aliases field on the edit page",
	"wikibaseschema-editpage-schema-inputlabel": "Input label for the Schema field on the edit page",
	"wikibaseschema-error-schemadeleted": "Error message when trying to edit a schema that doesn't exist.",
	"wikibaseschema-noschema": "Text that is shown on a non-existant page in the Schema namespace"
}
