{
	"@metadata": {
		"authors": [
			"The Wikidata Team",
			"Robby",
			"A2093064"
		]
	},
	"entityschema-desc": "{{desc|name=WikibaseSchema|url=https://www.mediawiki.org/wiki/Extension:WikibaseSchema}}",
	"special-newschema": "Title for the new Schema Special Page",
	"entityschema-newschema-label": "Input label for the label field on Special:NewSchema",
	"entityschema-newschema-description": "Input label for the description field on Special:NewSchema",
	"entityschema-newschema-aliases": "Input label for the aliases field on Special:NewSchema",
	"entityschema-newschema-schema-shexc": "Input label for the schema field (using Shape Expressions compact syntax) on Special:NewSchema",
	"entityschema-newschema-submit": "Label on the submit button on the NewSchema special page",
	"entityschema-newschema-copyright": "A short copyright warning displayed on the NewSchema special page.\n\nParameters:\n* $1 - the name of the button the message is referring to, set in the {{msg-mw|entityschema-newschema-submit}} message\n* $2 - the name of the wiki's page describing the terms of use\n* $3 - an external link to the license with the license's name as link text",
	"entityschema-anonymouseditwarning": "Warning message that is displayed using the MediaWiki notification system each time an anonymous user starts to edit something on a Schema page (e.g. by clicking an edit button).\n\nBasically, the message shall make the user aware that their IP will be recorded when saving as long as they are not logged in.",
	"entityschema-label-edit-placeholder": "Placeholder to add the label in the provided language.\n\nParameters:\n* $1 - the name of the language in the user interface language",
	"entityschema-description-edit-placeholder": "Placeholder to add the description in the provided language.\n\nParameters:\n* $1 - the name of the language in the user interface language",
	"entityschema-aliases-edit-placeholder": "Placeholder to add aliases in the provided language.\n\nParameters:\n* $1 - the name of the language in the user interface language",
	"entityschema-id-edit-placeholder": "Input label for the ID field on the edit page",
	"entityschema-editpage-schema-inputlabel": "Input label for the Schema field on the edit page",
	"entityschema-error-schemadeleted": "Error message when trying to edit a schema that doesn't exist.",
	"entityschema-error-schemaupdate-failed": "Error message when saving the Schema after edit wasn't successful",
	"entityschema-error-schematext-conflict": "Error message if there was an edit conflict for the Schema text from which we cannot recover.",
	"entityschema-error-namebadge-conflict": "Error message if there was an edit conflict for the Schema labels, descriptions and aliases from which we cannot recover.",
	"entityschema-error-saving-failed": "Error message when saving a schema has failed.\n\nParameters:\n* $1 - the message of the exception",
	"entityschema-error-not-post": "Error message when a HTTP POST request is expected but something else was received.",
	"entityschema-error-inconsistent-id": "Error message if revisions belonging to different pages were provided",
	"entityschema-error-wrong-page-revisions": "Error message when a given revision (e.g. for restoring) does not belong to the current page.",
	"entityschema-error-invalid-id": "Error message that the provided ID is invalid.",
	"entityschema-error-unsupported-langcode": "Error message that the provided language is not supported.",
	"entityschema-error-one-more-message-available": "Error message informing the user that the submission of a form has failed and that there is a more detailed error message available below.",
	"entityschema-error-possibly-multiple-messages-available": "Error message informing the user that the submission of a form has failed and that there is a more detailed error message available below. It is unknown whether there is one or more messages available.",
	"entityschema-error-schematext-too-long": "Error message when the Schema text is too long.\n\nParameters:\n* $1 - the maximum allowed length of the Schema text in bytes\n* $2 - the length of the schema text submitted by the user in bytes",
	"entityschema-error-input-too-long": "Error message when the label, description or concatenated aliases are too long.\n\nParameters:\n* $1 - the maximum allowed length of the label, description or concatenated aliases in characters\n* $2 - the length of the label, description or concatenated aliases submitted by the user in characters",
	"entityschema-noschema": "Text that is shown on a non-existant page in the Schema namespace",
	"entityschema-summary-generated": "The label above the summary input, stating that will be appended to a generated summary.",
	"entityschema-label-empty": "Text used for the page title when no label for the Schema is defined in the input language.",
	"entityschema-namebadge-header-language-code": "Header for the language code column of a table showing the “name badges” of a schema.",
	"entityschema-namebadge-header-label": "Header for the label column of a table showing the “name badges” of a schema.",
	"entityschema-namebadge-header-description": "Header for the description column of a table showing the “name badges” of a schema.",
	"entityschema-namebadge-header-aliases": "Header for the aliases column of a table showing the “name badges” of a schema.",
	"entityschema-namebadge-header-edit": "Header for the edit links column of a table showing the “name badges” of a schema.",
	"entityschema-diff-label": "Label designating the change in the Labels when viewing a diff of two Schemas",
	"entityschema-diff-description": "Label designating the change in the Description when viewing a diff of two Schemas\n{{Identical|Description}}",
	"entityschema-diff-aliases": "Label designating the change in the Aliases when viewing a diff of two Schemas",
	"entityschema-diff-schema": "Label designating the change in the Schema text when viewing a diff of two Schemas",
	"entityschema-edit": "Generic text used for links that lead to an edit form for a specific part of a Schema.\n{{Identical|edit}}",
	"entityschema-add-schema-text": "Text used for the link to the edit form to add the Schema text on a Schema page without any text so far.",
	"entityschema-check-entities": "Text used for a link that leads to an external tool where entities can be checked against the current schema.",
	"entityschema-summary-newschema-nolabel": "A generic message for the recent changes or page history, stating that the Schema was created.",
	"entityschema-summary-update": "A generic message used when different parts of a Schema may have been updated.",
	"entityschema-summary-update-schema-text": "Edit summary message used when a Schema's text was updated. Edit summary as supplied by the user will be shown after, if given.",
	"entityschema-summary-update-schema-text-user": "{{notranslate}}\nEdit summary message used when a Schema's text was updated.\n\nParameters:\n* $1 - Edit summary as given by the user.",
	"entityschema-summary-update-schema-namebadge": "A generic message used when different parts of a Schema may have been updated.\n\nParameters:\n* $1 - the language in which the edit was made.",
	"entityschema-summary-update-schema-label": "Edit summary message used when a Schema's label has been updated. \n\nParameters:\n* $1 - the language in which the edit was made.",
	"entityschema-summary-update-schema-description": "Edit summary message used when a Schema's description has been updated. \n\nParameters:\\n* $1 - the language in which the edit was made.",
	"entityschema-summary-update-schema-aliases": "Edit summary message used when a Schema's aliases have been updated. \n\nParameters:\\n* $1 - the language in which the edit was made.",
	"entityschema-summary-undo-autocomment": "Summary message for an undo to be shown in Schema history, recent changes etc. If the user left a custom summary, it will be appended to this message.\n\nParameters:\n* $1 - The ID of the revision that is undone\n* $2 Name of the user that created that revision",
	"entityschema-summary-restore-autocomment": "Summary message for a restore to be shown in Schema history, recent changes etc. If the user left a custom summary, it will be appended to this message.\n\nParameters:\n* $1 - The ID of the revision that is restored\n* $2 Name of the user that created that revision",
	"entityschema-undo-heading": "Heading for the undo view.\n\nParameters:\n* $1 - The ID of the Schema",
	"entityschema-undo-heading-failed": "Heading if the change cannot be undone for some reason",
	"entityschema-undo-bad-revisions": "Error message saying that the given revision versions don't work out.",
	"entityschema-undo-cannot-apply-patch": "Error message saying that the change cannot be undone because it was further changed later.",
	"entityschema-undo-old-revision": "short message for the undo view designating the left side as the revision that the user tries to undo",
	"entityschema-restore-heading": "Heading for the restore view.\n\nParameters:\n* $1 - The ID of the Schema",
	"entityschema-restore-bad-revisions": "Error message saying that the given revision cannot be restored.",
	"entityschema-restore-changed": "Error message saying that the Schema has changed since starting the restore action.",
	"entityschema-restore-heading-failed": "Heading if the revision cannot be restored for some reason",
	"entityschema-restore-empty": "Error message to be shown if the user tries to restore a revision that is identical to the current revision.",
	"entityschema-restoreold": "Link text shown on the link that lets the user restore the page's content to an old revision. Must be distinct from undo and revert. Used on the diff views.\n{{Identical|Restore}}",
	"special-schematext": "Title for the Special Page that gives access to the raw Schema text.",
	"entityschema-schematext-text": "Explanatory text to access the raw Schema text on Special:SchemaText.",
	"entityschema-schematext-missing": "Error message if raw text of a non-existant Schema is requested.\n\nParameters:\n* $1 - The ID of the requested Schema.",
	"entityschema-special-setlabeldescriptionaliases": "The title for Special:SetSchemaLabelDescriptionAliases in which the label, description and aliases of a Schema could be added or edited",
	"entityschema-special-id-inputlabel": "Field label for the ID field of Special:SetSchemaLabelDescriptionAliases",
	"entityschema-special-language-inputlabel": "Field label for the language code field of Special:SetSchemaLabelDescriptionAliases",
	"entityschema-special-id-submit": "Name of the submit button for the Schema selection phase of Special:SetSchemaLabelDescriptionAliases which leads to the edit field for label, description and aliases",
	"entityschema-special-setlabeldescriptionaliases-info": "Intro text when a label, description and aliases are to be set.\n\nParameters:\n* $1 - the translated language name (possibly autonym) the label, description and aliases are to be set in\n* $2 - the label (if available) of the Schema or its ID\n* $3 - the actual page title that links to the Schema",
	"entityschema-special-label": "Input label for the label field on Special:SetSchemaLabelDescriptionAliases",
	"entityschema-special-description": "Input label for the description field on Special:SetSchemaLabelDescriptionAliases:",
	"entityschema-special-aliases": "Input label for the aliases field on Special:SetSchemaLabelDescriptionAliases",
	"entityschema-special-id-placeholder": "Placeholder for the Schema ID field when retrieving a Schema to edit on Special:SetSchemaLabelDescriptionAliases"
}
